---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyRenderingType
source: html/203b8e98-c741-256c-47ff-151a823a99f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyRenderingType Property

"Render Appearance Source"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyRenderingType { get; }
```